# Yosys script 

# read desing
read_verilog contadores.v
hierarchy -check -top contadores

# the high-level stuff
proc; opt; fsm; opt; memory; opt;

# mapping to internal cell library
techmap;

# mapping flip-flops to <mycells.lib>
dfflibmap -liberty cmos_cells.lib

# mapping logic to <mycells.lib>
abc -liberty cmos_cells.lib

#cleanup
clean

# write synthesized design
write_verilog contadores_synth.v
