# Yosys script 

# read desing
read_verilog phy_rx.v
hierarchy -check -top phy_rx

# the high-level stuff
proc; opt; fsm; opt; memory; opt;

# mapping to internal cell library
techmap;

# mapping flip-flops to <mycells.lib>
dfflibmap -liberty cmos_cells.lib

# mapping logic to <mycells.lib>
abc -liberty cmos_cells.lib

#cleanup
clean

# write synthesized design
write_verilog phy_rx_synth.v