#Lee el archivo de verilog
read_verilog Serial_paralelo_tx.v
hierarchy -check -top Serial_paralelo_tx

#optimizaciones
proc; opt; fsm; opt; memory; opt

#mapeo a la libreria interna 
techmap; opt

#mapea FF en cmos_cells
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas en cmos_cells
abc -liberty cmos_cells.lib

#limpieza
clean

#escribe el archivo sintetizado
write_verilog serial_paralelo_synth.v 
