# Yosys script 

# read desing
read_verilog recirculador.v
hierarchy -check -top recirculador

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap;

# mapping flip-flops to <mycells.lib>
dfflibmap -liberty ../../cmos_cells/cmos_cells.lib

# mapping logic to <mycells.lib>
abc -liberty ../../cmos_cells/cmos_cells.lib

#cleanup
clean

# write synthesized design
write_verilog synth_recirculador.v