#lee archivo de verilog
read_verilog MUXES.v 
hierarchy -check -top MUXES 

#optimizaciones 
proc; opt; fsm; opt; memory; opt

#mapeo a la liberia interna
techmap; opt  

#mapea FF en cmos_cells
dfflibmap -liberty cmos_cells.lib

#mapea compuertas lógicas en cmos_cells
abc   -liberty  cmos_cells.lib

#limpieza
clean

#escribe el archivo sintetizado
write_verilog MUXES_synth.v

#muestra el diagrama dot
#show

